Rh1ne-ops/stm32f103-learning/9-2串口发送+接收1/Hardware/Serial1.c
#include "stm32f10x.h"                  // Device header
#include "stdio.h"
#include "stdarg.h"

uint8_t RxData;
uint8_t RxFlag;

void Serial_Init(void){

	GPIO_InitTypeDef GPIO_InitStructure;
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1,ENABLE);
	GPIO_InitStructure.GPIO_Mode =  GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin	= GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Speed	=GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Mode =  GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin	= GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Speed	=GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
		
	USART_InitTypeDef USART_InitStructure;
	USART_InitStructure.USART_Mode=USART_Mode_Tx |USART_Mode_Rx;
	USART_InitStructure.USART_Parity=USART_Parity_No;
	USART_InitStructure.USART_BaudRate=9600;
	USART_InitStructure.USART_StopBits=USART_StopBits_1;
	USART_InitStructure.USART_WordLength=USART_WordLength_8b;
	USART_InitStructure.USART_HardwareFlowControl=USART_HardwareFlowControl_None;
	
	USART_Init(USART1,&USART_InitStructure);
	
	USART_ITConfig(USART1,USART_IT_RXNE,ENABLE);
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel=USART1_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd=ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority=1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority=1;
	
	NVIC_Init(&NVIC_InitStructure);
	USART_Cmd(USART1,ENABLE);
}
void Serial_SendByte(uint16_t Byte)
{
	USART_SendData(USART1,Byte);
	while(USART_GetFlagStatus(USART1,USART_FLAG_TXE)== RESET);
}
void Serial_SendArray(uint8_t *Array,uint16_t length)
{
	for(int16_t i=0;i<length;i++)
	{
	Serial_SendByte(Array[i]);
	}
}
void Serial_SendString(char*String)
{
	uint8_t i;
	for(i=0;String[i]!='\0';i++)
	{
		Serial_SendByte(String[i]);
	}
}	
uint32_t Serial_Pow(uint32_t X,uint32_t Y)
{
	uint32_t result =1;
	while(Y--)
	{
	result *= X;
	}
	return result;
}
void Serial_SendNumber(uint32_t Num,uint8_t length)
{
	uint8_t i;
	for(i=0;i<length;i++)
	{
		Serial_SendByte(Num/Serial_Pow(10,length-i-1)%10+'0');
	}
}
int fputc(int ch,FILE *f)
{
	Serial_SendByte(ch);
	return ch;
}
void Serial_Printf(char*format,...)
{
	char String[100];
	va_list arg;
	va_start(arg,format);
	vsprintf(String,format,arg);
	va_end(arg);
	Serial_SendString(String);
}
uint8_t Serial_GetFlag(void)
{
	if(RxFlag ==1)
	{
		RxFlag =0;
		return 1;
	}
	return 0;
}
uint8_t Serial_GetData(void)
{
	return RxData;
}
void USART1_IRQHandler(void)
{
	if(USART_GetITStatus(USART1,USART_IT_RXNE)==SET)
	{
		RxData = USART_ReceiveData(USART1);
		RxFlag =1;
		USART_ClearITPendingBit(USART1,USART_IT_RXNE);
	
	
	}


}













